package com.mahdi.model.characters.enums;

public enum State {
    // --- حرکت و ایستادن پایه ---
    IDLE,              // ایستادن معمولی (فایل‌های Idle)
    RUNNING,           // دویدن سریع (فایل‌های Run)
    SLOW_WALK,         // راه رفتن آهسته و معمولی (فایل‌های Walk)
    RUN_TO_IDLE,       // ترمز نرم و انتقال از دویدن به ایستادن (فایل‌های Run To Idle)
    LOOK_UP,           // نگاه کردن به بالا (فایل‌های LookUp)
    LOOK_DOWN,         // نگاه کردن به پایین (فایل‌های LookDown)

    // --- وضعیت‌های فیزیکی هوایی ---
    JUMPING,           // شروع پرش و بالا رفتن در هوا (فایل‌های Airborne)
    DOUBLE_JUMP,       // پرش دوتایی در هوا (فایل‌های Double Jump)
    FALLING,           // سقوط آزاد (فایل‌های Fall)
    LANDING,           // انیمیشن فشرده شدن شوالیه هنگام فرود روی زمین (فایل‌های Landing)

    // --- سیستم مبارزه (اکشن‌ها) ---
    SLASH,             // ضربه شمشیر افقی معمولی - حالت اول (فایل‌های Slash)
    SLASH_ALT,         // ضربه شمشیر افقی ترکیبی - حالت دوم (فایل‌های SlashAlt)
    UP_SLASH,          // ضربه شمشیر به سمت بالا (فایل‌های UpSlash)
    DOWN_SLASH,        // ضربه شمشیر به سمت پایین روی هوا / پوجو (فایل‌های DownSlash)

    // --- مکانیزم‌های حرکتی پیشرفته ---
    DASH,              // دَش زدن سریع افقی (فایل‌های Dash)
    WALL_SLIDE,        // سر خوردن آرام روی دیوار (فایل‌های Wall Slide)
    WALL_JUMP,         // پرش از روی دیوار (فایل‌های Walljump)

    // --- جادو، سلامتی و مرگ ---
    FOCUS_START,       // شروع حالت تمرکز و فعال شدن هاله (فایل‌های Focus Start)
    FOCUS,             // چرخه‌ی اصلیِ نگه داشتن تمرکز و شارژ (فایل‌های Focus)
    FOCUS_GET,         // لحظه دقیق پر شدن و دریافت یک خط جان (فایل‌های Focus Get)
    FOCUS_END,         // اتمام حالت تمرکز و رها کردن دکمه (فایل‌های Focus End)
    FIREBALL_CAST,     // شلیک جادوی روح یا همان فایربال (فایل‌های Fireball Cast)
    HURT,              // آسیب دیدن و افکت عقب‌رانده شدن (فایل‌های Idle Hurt)
    SCREAM,            // فریادِ خشم یا انیمیشن‌های شروع ابیلیتی‌ها (فایل‌های Scream)
    DEATH               // مرگ شوالیه (فایل‌های Death)
}


